console.log("HW 2");
// Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль.
// Т (° F) = Т (° C) × 1,8 + 32

{
    const C = 25;
    const F = C * 1.8 + 32;
    console.log(F);
}

// Створити змінну для зберігання кількості днів у місяці. Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.

{
    const countD = 31;
    const countH = countD * 24;
    const countM = countH * 60;
    console.log(`HH = ${countH}, mm = ${countM}`);
}

// Створити змінні для зберігання рівня здоров'я та енергії гравця в грі. Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.

{
    let health = 100;
    let energy = 100;
    health = health - 99;
    // health -= 99;
    energy = energy - 9;
    console.log(`Health = ${health}, energy = ${energy}`);
}

// Створити змінну для зберігання суми покупки в магазині. Застосувати знижку в розмірі 10% до цієї суми за допомогою оператора множення та вивести результат в консоль.]
{
    const sum = 2400;
    const discount = 10;
    const total = sum - sum * discount / 100;
    console.log(`Total = ${total}`);
}

// Створити змінну для зберігання числа з плаваючою комою. Використати метод Math.floor() для округлення числа до меншого та вивести результат в консоль.

{
    const num = 3.784;
    const result = Math.floor(num);
    console.log(result);
}

// Створити змінну для зберігання рядка, який містить числа з плаваючою комою. Використати метод parseFloat() для перетворення рядка у десяткове число та вивести результат в консоль.

{
    const str = '.56am0';
    const result = parseFloat(str);
    console.log(result);
}

// Створити змінну для зберігання рядка, який містить ціле число. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль.

{
    const str = '5.56am0';
    const result = parseInt(str);
    console.log(result);
}

// Створити змінну для зберігання числа. Використати метод Math.sqrt() для обчислення квадратного кореня числа та вивести результат в консоль.

{
    const num = 5;
    const result = Math.sqrt(num);
    console.log(result);
}

// Створити змінні для зберігання цілочисельного значення та рядка з числом у вигляді рядка. 
// Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль. 
// Потім використати метод toString() для перетворення цілочисельного значення у рядок та вивести результат в консоль.

{
    const str = '5.56am0';
    const num = parseInt(str);
    const result = num.toString();
    console.log(`num = ${num} (${typeof num}), result = ${result} (${typeof result})`);
}